microchip-pic-avr-examples/dspic33e-code-examples/dspic33e-intr-in-aux-flash-alt/firmware/src/system_config/exp16/dspic33ep512mu810/main.c
/*******************************************************************************
  Company:
    Microchip Technology Inc.

  File Name:
    main.c

  Summary:
    This file demonstrates how to handle interrupts in auxiliary flash. 

  Description:
    The timer 1 is initialized to generate interrupt and interrupt is handled in auxiliary flash.
 *******************************************************************************/
/*******************************************************************************
Copyright (c) 2012 released Microchip Technology Inc.  All rights reserved.

Microchip licenses to you the right to use, modify, copy and distribute
Software only when embedded on a Microchip microcontroller or digital signal
controller that is integrated into your product or third party product
(pursuant to the sublicense terms in the accompanying license agreement).

You should refer to the license agreement accompanying this Software for
additional information regarding your rights and obligations.

SOFTWARE AND DOCUMENTATION ARE PROVIDED "AS IS" WITHOUT WARRANTY OF ANY KIND,
EITHER EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF
MERCHANTABILITY, TITLE, NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE.
IN NO EVENT SHALL MICROCHIP OR ITS LICENSORS BE LIABLE OR OBLIGATED UNDER
CONTRACT, NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR
OTHER LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES
INCLUDING BUT NOT LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE OR
CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA, COST OF PROCUREMENT OF
SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY THIRD PARTIES
(INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.
 *******************************************************************************/
// *****************************************************************************
// *****************************************************************************
// Section: Included Files
// *****************************************************************************
// *****************************************************************************
#include <xc.h>
#include <stdint.h>

#if __XC16_VERSION < 1011
#warning "Please upgrade to XC16 v1.11 or newer."
#endif

// *****************************************************************************
// *****************************************************************************
// Section: Macros for Configuration Fuse Registers:
// *****************************************************************************
// *****************************************************************************
// DSPIC33EP512MU810 Configuration Bit Settings
// FGS
#pragma config GWRP = OFF           // General Segment Write-Protect bit (General Segment may be written)
#pragma config GSS = OFF            // General Segment Code-Protect bit (General Segment Code protect is disabled)
#pragma config GSSK = OFF           // General Segment Key bits (General Segment Write Protection and Code Protection is Disabled)

// FOSCSEL
#pragma config FNOSC = FRC          // Initial Oscillator Source Selection Bits (Internal Fast RC (FRC))
#pragma config IESO = OFF           // Two-speed Oscillator Start-up Enable bit (Start up with user-selected oscillator source)

// FOSC
#pragma config POSCMD = XT          // Primary Oscillator Mode Select bits (XT Crystal Oscillator Mode)
#pragma config OSCIOFNC = OFF       // OSC2 Pin Function bit (OSC2 is clock output)
#pragma config IOL1WAY = OFF        // Peripheral pin select configuration (Allow multiple reconfigurations)
#pragma config FCKSM = CSECMD       // Clock Switching Mode bits (Clock switching is enabled,Fail-safe Clock Monitor is disabled)

// FWDT
#pragma config WDTPOST = PS32768    // Watchdog Timer Postscaler Bits (1:32,768)
#pragma config WDTPRE = PR128       // Watchdog Timer Prescaler bit (1:128)
#pragma config PLLKEN = ON          // PLL Lock Wait Enable bit (Clock switch to PLL source will wait until the PLL lock signal is valid.)
#pragma config WINDIS = OFF         // Watchdog Timer Window Enable bit (Watchdog Timer in Non-Window mode)
#pragma config FWDTEN = OFF         // Watchdog Timer Enable bit (Watchdog timer enabled/disabled by user software)

// FPOR
#pragma config FPWRT = PWR128       // Power-on Reset Timer Value Select bits (128ms)
#pragma config BOREN = ON           // Brown-out Reset (BOR) Detection Enable bit (BOR is enabled)
#pragma config ALTI2C1 = ON         // Alternate I2C pins for I2C1 (ASDA1/ASCK1 pins are selected as the I/O pins for I2C1)
#pragma config ALTI2C2 = ON         // Alternate I2C pins for I2C2 (ASDA2/ASCK2 pins are selected as the I/O pins for I2C2)

// FICD
#pragma config ICS = PGD1           // ICD Communication Channel Select bits (Communicate on PGEC1 and PGED1)
#pragma config RSTPRI = AF          // Reset Target Vector Select bit (Device will obtain reset instruction from Aux flash)
#pragma config JTAGEN = OFF         // JTAG Enable bit (JTAG is disabled)

// FAS
#pragma config AWRP = OFF           // Auxiliary Segment Write-protect bit (Auxiliary program memory is not write-protected)
#pragma config APL = OFF            // Auxiliary Segment Code-protect bit (Aux Flash Code protect is disabled)
#pragma config APLK = OFF           // Auxiliary Segment Key bits (Aux Flash Write Protection and Code Protection is Disabled)

// *****************************************************************************
// *****************************************************************************
// Section: File Scope or Global Constants
// *****************************************************************************

// *****************************************************************************
#define mInitAllLEDs()  { TRISA = 0; LATA = 0; }

#define mLED_1          LATAbits.LATA6
#define mLED_2          LATAbits.LATA7

#define mLED_1_On()     mLED_1 = 1;
#define mLED_2_On()     mLED_2 = 1;

#define mLED_1_Tgl()    mLED_1 = !mLED_1;

// LED state variable
unsigned int led_State = 1;

// Function Prototype
void    InitializeBoard( void );

/******************************************************************************
 * Function:        int main(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Main function
 *****************************************************************************/
#ifdef TEST_MODE
unsigned char test_flag;
int ce_main(void)
#else
int main(void)
#endif
{
#ifdef TEST_MODE
    test_flag=0;
#endif
    InitializeBoard();

    // Initialize the Led Port
    mInitAllLEDs();

    mLED_1_On();
    mLED_2_On();
#ifdef TEST_MODE
    while( 1 )
    {
       
        if(test_flag ==1)
            return 0;
    }
#else
     while( 1 );
    {
        // Let the interrupt toggle LEDs.
    }
    return ( 0 );
#endif
}

//--------------------------------------------------------

///Auxilliary Interrupt
/******************************************************************************
 * Function:        void __attribute__((__interrupt__, no_auto_psv)) _Aux_Interrupt( void )
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        ISR ROUTINE FOR THE Auxillary INTERRUPT, Toggles the LED
 *****************************************************************************/
void __attribute__ ( (__interrupt__, no_auto_psv) ) _Aux_Interrupt( void )
{
    if( IFS0bits.T1IF )
    {
        // Timer 1 interrupt has occured.
        mLED_1 = led_State;
        led_State = !led_State;
        mLED_2 = led_State;
        TMR1 = 0;
#ifdef TEST_MODE
        test_flag=1;
#endif
        /* Clear Timer1 interrupt */
        IFS0bits.T1IF = 0;
    }
    else
    {
        // Handle other interrupts.
    }
}

/********************************************************************
 * Function:         void InitializeBoard(void
 *
 * Precondition:     None
 *
 * Input:            None.
 *
 * Output:           None
 *
 * Side Effects:     None.
 *
 * Overview:         Intializes the controller to operate at 60MIPS.
                    Initializes USB peripheral, Timer and LEDs.
 *
 ********************************************************************/
void InitializeBoard( void )
{
    // Setup configuration
    PLLFBD = 58;                                // M=60
    CLKDIVbits.PLLPOST = 0;                     // N1=2
    CLKDIVbits.PLLPRE = 0;                      // N2=2
    OSCTUN = 0;                                 // Tune FRC oscillator, if FRC is used

    // Disable Watch Dog Timer
    RCONbits.SWDTEN = 0;

    // Clock switching to incorporate PLL
    __builtin_write_OSCCONH( 0x03 );            // Initiate Clock Switch to Primary

    // Oscillator with PLL (NOSC=0b011)
    __builtin_write_OSCCONL( OSCCON || 0x01 );  // Start clock switching
    while( OSCCONbits.COSC != 0b011 );

    // Wait for Clock switch to occur
    // Wait for PLL to lock
    while( OSCCONbits.LOCK != 1 )
    { };

    // Timer setup for LED blinking.
    T1CONbits.TON = 0;
    T1CONbits.TGATE = 0;
    T1CONbits.TCKPS = 3;
    T1CONbits.TCS = 0;
    PR1 = 0x8000;
    T1CONbits.TON = 1;

    // GLobal interrupt enable.
    INTCON2bits.GIE = 1;

    // Timer interrupt enable bit.
    IEC0bits.T1IE = 1;
}

/*******************************************************************************
 End of File
 */
